brew "bat"
brew "fd"
brew "fish"
brew "git"
brew "helix"
brew "pre-commit"
brew "ripgrep"
brew "starship"
brew "zellij"

# Shell development
brew "bash-language-server"
brew "shellcheck"
brew "shfmt"

cask "1password"
cask "alacritty"
cask "brave-browser"
