brew "age"
brew "fd"
brew "fish"
brew "fzy"
brew "helix"
brew "htop"
brew "hyperfine"
brew "jump"
brew "pre-commit"
brew "ripgrep"
brew "starship"
brew "tmux"
brew "zellij"

# Beancount
brew "beancount"
brew "beancount-language-server"
brew "fava"

# Git
brew "git"
brew "git-absorb"
brew "git-delta"

# Markdown
brew "ltex-ls"

# Python
brew "pyright"
brew "ruff"
brew "ruff-lsp"

# Rust
brew "rustup"

# Shell
brew "bash-language-server"
brew "shellcheck"
brew "shfmt"

# TOML
brew "taplo"

# YAML
brew "prettier"

# Casks
cask "1password"
cask "1password-cli"
cask "alacritty"
cask "anki"
cask "brave-browser"
cask "maestral"
cask "rectangle"
cask "signal"
cask "standard-notes"
