brew "age"
brew "fd"
brew "fish"
brew "fzy"
brew "helix"
brew "jump"
brew "ltex-ls"
brew "ripgrep"
brew "starship"
brew "tmux"

# Beancount
brew "beancount"
brew "beancount-language-server"
brew "fava"

# Git
brew "gh"
brew "git"
brew "git-absorb"
brew "git-delta"

# Programming
brew "bash-language-server"
brew "pre-commit"
brew "prettier"
brew "pyright"
brew "ruff"
brew "shellcheck"
brew "shfmt"
brew "taplo"
brew "uv"

# Casks
cask "1password"
cask "1password-cli"
cask "anki"
cask "firefox"
cask "imageoptim"
cask "kitty"
cask "maestral"
cask "rectangle"
cask "signal"
cask "spotify"
cask "standard-notes"
cask "uhk-agent"
cask "whatsapp"

# Fonts
cask "font-jetbrains-mono"
